tutorials/LES/Sumer2011/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
  alpha.sol
  {
    field alpha.sol;
    keepPatches true;
    expression "0.5*0.61*(1+tanh(800*(-0.44362+0.0739367*pos().x-pos().y)))";
    condition  "(pos().x<10.5) && (pos().x>=9.5)";
  }
);

// ************************************************************************* //
